[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:84:11
   public load(fileContents: string) {
     const tables: string[] = fileContents.split(';');       /* split on ';' to separate into individual tables */
     for (const table of tables) {                           /* iterate over tables */
-      if (this.nonEmptyRegex.test(table)) {                 /* skip any tables/line that consist only of whitespace */
+      if (false) {                 /* skip any tables/line that consist only of whitespace */
         const lines = table.split('\n');                    /* split table into lines */
         const tableName = lines[0].trim();                  /* ';' was removed by first split, so first line is the table name */
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: table \"key\" has no entries and was skipped"

Number of calls: 0

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:103:15
           }
         }
         if (list.length > 0) {
-          if (this.hasTable(tableName)) {
+          if (false) {
             console.warn(`Abulafia Warning: overwrote entries for table "${tableName}"`);
           }
killedBy: Tests for abulafia.js loads a minimal table twice and logs a warning and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: overwrote entries for table \"key\""

Number of calls: 0

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:103:15
           }
         }
         if (list.length > 0) {
-          if (this.hasTable(tableName)) {
+          if (true) {
             console.warn(`Abulafia Warning: overwrote entries for table "${tableName}"`);
           }
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 0
Received number of calls: 1

[Killed] StringLiteral
Projects/abulafia-ts/src/abulafia.ts:108:24
           }
           this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
         } else {                                            /* warn if we skipped a table because it has no entries */
-          console.warn(`Abulafia Warning: table "${tableName}" has no entries and was skipped`);
+          console.warn(``);
         }
       }
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: table \"key\" has no entries and was skipped"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:119:14
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
+          if(true) {
             out.push(match.substring(1,match.length-1));
           }
killedBy: Tests for abulafia.js loads multiple tables with references and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   "key2",

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:119:65
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
+          if(!this.hasTable(match.substring(1,match.length-1))) {}
         })
       })
killedBy: Tests for abulafia.js detects missing references
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "value",
- ]
