[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:14:60
   //   this.used = new Map();
   // }
 
-  private randIntInRange(min: number, max: number): number {
-    // Stryker disable next-line ArithmeticOperator
-    return Math.floor(Math.random() * (max - min + 1) + min);
-  }
+  private randIntInRange(min: number, max: number): number {}
 
   private choose(list: string[]): string {
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property 'match' of undefined

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:19:42
     return Math.floor(Math.random() * (max - min + 1) + min);
   }
 
-  private choose(list: string[]): string {
-    return list[this.randIntInRange(0, list.length-1)];
-  }
+  private choose(list: string[]): string {}
 
   private lookup(key: string): string[] {
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property 'match' of undefined

[Killed] ArithmeticOperator
Projects/abulafia-ts/src/abulafia.ts:20:40
   }
 
   private choose(list: string[]): string {
-    return list[this.randIntInRange(0, list.length-1)];
+    return list[this.randIntInRange(0, list.length + 1)];
   }
 
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property 'match' of undefined

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:23:41
     return list[this.randIntInRange(0, list.length-1)];
   }
 
-  private lookup(key: string): string[] {
-    const list: string[] | undefined = this.data.get(key);
-    if (!list) {
-      throw new Error(`Abulafia Error: No table for key "${key}"`);
-    }
-    return list;
-  }
+  private lookup(key: string): string[] {}
 
   private replacer(match: string): string {
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""
Received message:   "Cannot read property 'length' of undefined"

      87 |     } else {
      88 |       stryCov_9fa48("13");
    > 89 |       return list[this.randIntInRange(0, stryMutAct_9fa48("14") ? list.length + 1 : (stryCov_9fa48("14"), list.length - 1))];

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:25:9
 
   private lookup(key: string): string[] {
     const list: string[] | undefined = this.data.get(key);
-    if (!list) {
+    if (true) {
       throw new Error(`Abulafia Error: No table for key "${key}"`);
     }
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: Abulafia Error: No table for key "key"

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:25:16
 
   private lookup(key: string): string[] {
     const list: string[] | undefined = this.data.get(key);
-    if (!list) {
-      throw new Error(`Abulafia Error: No table for key "${key}"`);
-    }
+    if (!list) {}
     return list;
   }
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""
Received message:   "Cannot read property 'length' of undefined"

      87 |     } else {
      88 |       stryCov_9fa48("13");
    > 89 |       return list[this.randIntInRange(0, stryMutAct_9fa48("14") ? list.length + 1 : (stryCov_9fa48("14"), list.length - 1))];

[Killed] StringLiteral
Projects/abulafia-ts/src/abulafia.ts:26:23
   private lookup(key: string): string[] {
     const list: string[] | undefined = this.data.get(key);
     if (!list) {
-      throw new Error(`Abulafia Error: No table for key "${key}"`);
+      throw new Error(``);
     }
     return list;
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""
Received message:   ""

      103 |         } else {
      104 |           stryCov_9fa48("19");
    > 105 |           throw new Error(stryMutAct_9fa48("20") ? `` : (stryCov_9fa48("20"), `Abulafia Error: No table for key "${key}"`));

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:31:43
     return list;
   }
 
-  private replacer(match: string): string {
-    const key: string = match.substring(1,match.length-1);
-    // const parts = key.split(':');
-    // if (parts.length > 1) {
-    //   switch (parts[0]) { //xc vs xcFirst
-    //       case 'uc': return this.choose(this.lookup(parts[1])).toUpperCase();
-    //       case 'lc': return this.choose(this.lookup(parts[1])).toLowerCase();
-    //       case 'tc': return toTitleCase(this.choose(this.lookup(parts[1])));
-    //       case 'two': return this.choose2(this.lookup(parts[1]), parts[2]);
-    //       case 'uniq': return this.chooseUnique(parts[1]);
-    //       //case 'reverse'
-    //       //case rot13
-    //       default:
-    //         throw new Error(`Abulafia Error: unknown function '${parts[0]}'`);
-    //   }
-    // }
-    return this.choose(this.lookup(key));
-  }
+  private replacer(match: string): string {}
 
   private process(item: string): string {
killedBy: Tests for abulafia.js loads multiple tables with references and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "foo"
Received: "undefined"

[Killed] ArithmeticOperator
Projects/abulafia-ts/src/abulafia.ts:32:43
   }
 
   private replacer(match: string): string {
-    const key: string = match.substring(1,match.length-1);
+    const key: string = match.substring(1,match.length + 1);
     // const parts = key.split(':');
     // if (parts.length > 1) {
killedBy: Tests for abulafia.js loads multiple tables with references and returns correct output
statusReason: Error: Abulafia Error: No table for key "key2]"

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:50:41
     return this.choose(this.lookup(key));
   }
 
-  private process(item: string): string {
-    const matches = item.match(this.referenceRegex);
-    if (matches && matches[0]) {
-      return this.process(item.replace(this.referenceRegex, this.replacer(matches[0])));
-    } else {
-      return item;
-    }
-  }
+  private process(item: string): string {}
 
   public hasTable(tableName: string) { /* check whether table of that name is loaded */
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "value"
Received: undefined

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:52:9
 
   private process(item: string): string {
     const matches = item.match(this.referenceRegex);
-    if (matches && matches[0]) {
+    if (true) {
       return this.process(item.replace(this.referenceRegex, this.replacer(matches[0])));
     } else {
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property '0' of null

[Killed] LogicalOperator
Projects/abulafia-ts/src/abulafia.ts:52:9
 
   private process(item: string): string {
     const matches = item.match(this.referenceRegex);
-    if (matches && matches[0]) {
+    if (matches || matches[0]) {
       return this.process(item.replace(this.referenceRegex, this.replacer(matches[0])));
     } else {
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property '0' of null

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:54:12
     const matches = item.match(this.referenceRegex);
     if (matches && matches[0]) {
       return this.process(item.replace(this.referenceRegex, this.replacer(matches[0])));
-    } else {
-      return item;
-    }
+    } else {}
   }
 
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "value"
Received: undefined

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:59:38
     }
   }
 
-  public hasTable(tableName: string) { /* check whether table of that name is loaded */
-    // Stryker disable next-line LogicalOperator
-    return this.data.has(tableName) && this.data.get(tableName);
-  }
+  public hasTable(tableName: string) {}
 
   public get(key: string) {
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:61:12
 
   public hasTable(tableName: string) { /* check whether table of that name is loaded */
     // Stryker disable next-line LogicalOperator
-    return this.data.has(tableName) && this.data.get(tableName);
+    return false;
   }
 
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:61:12
 
   public hasTable(tableName: string) { /* check whether table of that name is loaded */
     // Stryker disable next-line LogicalOperator
-    return this.data.has(tableName) && this.data.get(tableName);
+    return true;
   }
 
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:64:27
     return this.data.has(tableName) && this.data.get(tableName);
   }
 
-  public get(key: string) {
-    // this.resetUsed();
-    return this.process(this.choose(this.lookup(key)));
-  }
+  public get(key: string) {}
 
   public getList(key: string): string[] {
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""

Received function did not throw

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:69:41
     return this.process(this.choose(this.lookup(key)));
   }
 
-  public getList(key: string): string[] {
-    const list: string[] | undefined = this.data.get(key);
-    if (!list) {
-      throw new Error(`Abulafia Error: No table for key "${key}"`);
-    }
-    return list;
-  }
+  public getList(key: string): string[] {}
 
   public getTableNames() {
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""

Received function did not throw

[Killed] BooleanLiteral
Projects/abulafia-ts/src/abulafia.ts:71:9
 
   public getList(key: string): string[] {
     const list: string[] | undefined = this.data.get(key);
-    if (!list) {
+    if (list) {
       throw new Error(`Abulafia Error: No table for key "${key}"`);
     }
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""

Received function did not throw

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:71:9
 
   public getList(key: string): string[] {
     const list: string[] | undefined = this.data.get(key);
-    if (!list) {
+    if (false) {
       throw new Error(`Abulafia Error: No table for key "${key}"`);
     }
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Abulafia Error: No table for key \"key\""

Received function did not throw

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:77:26
     return list;
   }
 
-  public getTableNames() {
-    return [...this.data.keys()];
-  }
+  public getTableNames() {}
   
   public load(fileContents: string) {
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
Projects/abulafia-ts/src/abulafia.ts:78:12
   }
 
   public getTableNames() {
-    return [...this.data.keys()];
+    return [];
   }
   
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "key",
- ]

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:84:11
   public load(fileContents: string) {
     const tables: string[] = fileContents.split(';');       /* split on ';' to separate into individual tables */
     for (const table of tables) {                           /* iterate over tables */
-      if (this.nonEmptyRegex.test(table)) {                 /* skip any tables/line that consist only of whitespace */
+      if (true) {                 /* skip any tables/line that consist only of whitespace */
         const lines = table.split('\n');                    /* split table into lines */
         const tableName = lines[0].trim();                  /* ';' was removed by first split, so first line is the table name */
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:84:43
   public load(fileContents: string) {
     const tables: string[] = fileContents.split(';');       /* split on ';' to separate into individual tables */
     for (const table of tables) {                           /* iterate over tables */
-      if (this.nonEmptyRegex.test(table)) {                 /* skip any tables/line that consist only of whitespace */
-        const lines = table.split('\n');                    /* split table into lines */
-        const tableName = lines[0].trim();                  /* ';' was removed by first split, so first line is the table name */
-        const entries: string[] = lines.slice(1);           /* slice off the table name line */
-        const list = [];
-        for (const entry of entries) {                    /* iterate over remaining lines */
-          if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
-            const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
-            const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
-            for (let i = 0; i < weight; i++) {            /* add the line weight times */
-              list.push(text);                            /* put the lines into the list */
-            }
-          } else {
-            if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
-              console.warn(`Abulafia Warning: could not parse line "${entry}"`)
-            }
-          }
-        }
-        if (list.length > 0) {
-          this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
-        } else {                                            /* warn if we skipped a table because it has no entries */
-          console.warn(`Abulafia Warning: table "${tableName}" has no entries and was skipped`);
-        }
-      }
+      if (this.nonEmptyRegex.test(table)) {}
     }
   }
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: table \"key\" has no entries and was skipped"

Number of calls: 0

[Killed] ArrayDeclaration
Projects/abulafia-ts/src/abulafia.ts:88:22
         const lines = table.split('\n');                    /* split table into lines */
         const tableName = lines[0].trim();                  /* ';' was removed by first split, so first line is the table name */
         const entries: string[] = lines.slice(1);           /* slice off the table name line */
-        const list = [];
+        const list = ["Stryker was here"];
         for (const entry of entries) {                    /* iterate over remaining lines */
           if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "key",

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:89:38
         const tableName = lines[0].trim();                  /* ';' was removed by first split, so first line is the table name */
         const entries: string[] = lines.slice(1);           /* slice off the table name line */
         const list = [];
-        for (const entry of entries) {                    /* iterate over remaining lines */
-          if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
-            const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
-            const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
-            for (let i = 0; i < weight; i++) {            /* add the line weight times */
-              list.push(text);                            /* put the lines into the list */
-            }
-          } else {
-            if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
-              console.warn(`Abulafia Warning: could not parse line "${entry}"`)
-            }
-          }
-        }
+        for (const entry of entries) {}
         if (list.length > 0) {
           this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: Abulafia Error: No table for key "key"

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:90:15
         const entries: string[] = lines.slice(1);           /* slice off the table name line */
         const list = [];
         for (const entry of entries) {                    /* iterate over remaining lines */
-          if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
+          if (true) {              /* make sure we don't have a bad line */
             const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
             const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
killedBy: Tests for abulafia.js loads a minimal table with a bad entries and logs a warning and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "value"
Received: "bad"

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:90:44
         const entries: string[] = lines.slice(1);           /* slice off the table name line */
         const list = [];
         for (const entry of entries) {                    /* iterate over remaining lines */
-          if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
-            const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
-            const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
-            for (let i = 0; i < weight; i++) {            /* add the line weight times */
-              list.push(text);                            /* put the lines into the list */
-            }
-          } else {
+          if (this.entryRegex.test(entry)) {} else {
             if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
               console.warn(`Abulafia Warning: could not parse line "${entry}"`)
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: Abulafia Error: No table for key "key"

[Killed] ArithmeticOperator
Projects/abulafia-ts/src/abulafia.ts:92:42
         for (const entry of entries) {                    /* iterate over remaining lines */
           if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
             const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
-            const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
+            const text = entry.substring(entry.indexOf(',') - 1); /* split off everything up to the first comma, take the remainder */
             for (let i = 0; i < weight; i++) {            /* add the line weight times */
               list.push(text);                            /* put the lines into the list */
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "value"
Received: "1,value"

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:93:46
           if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
             const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
             const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
-            for (let i = 0; i < weight; i++) {            /* add the line weight times */
-              list.push(text);                            /* put the lines into the list */
-            }
+            for (let i = 0; i < weight; i++) {}
           } else {
             if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: Abulafia Error: No table for key "key"

[Killed] EqualityOperator
Projects/abulafia-ts/src/abulafia.ts:93:29
           if (this.entryRegex.test(entry)) {              /* make sure we don't have a bad line */
             const weight = parseInt(entry);               /* entry must begin with a number, which parseInt will handle */
             const text = entry.substring(entry.indexOf(',')+1); /* split off everything up to the first comma, take the remainder */
-            for (let i = 0; i < weight; i++) {            /* add the line weight times */
+            for (let i = 0; i <= weight; i++) {            /* add the line weight times */
               list.push(text);                            /* put the lines into the list */
             }
killedBy: Tests for abulafia.js loads a table with only 0 weighted entries and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "key",

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:96:18
             for (let i = 0; i < weight; i++) {            /* add the line weight times */
               list.push(text);                            /* put the lines into the list */
             }
-          } else {
-            if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
-              console.warn(`Abulafia Warning: could not parse line "${entry}"`)
-            }
-          }
+          } else {}
         }
         if (list.length > 0) {
killedBy: Tests for abulafia.js loads a minimal table with a bad entries and logs a warning and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: could not parse line \"bad\""

Number of calls: 0

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:97:49
               list.push(text);                            /* put the lines into the list */
             }
           } else {
-            if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
-              console.warn(`Abulafia Warning: could not parse line "${entry}"`)
-            }
+            if (this.nonEmptyRegex.test(entry)) {}
           }
         }
killedBy: Tests for abulafia.js loads a minimal table with a bad entries and logs a warning and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: could not parse line \"bad\""

Number of calls: 0

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:97:17
               list.push(text);                            /* put the lines into the list */
             }
           } else {
-            if (this.nonEmptyRegex.test(entry)) {         /* warn about any non-empty lines that we failed to parse */
+            if (false) {         /* warn about any non-empty lines that we failed to parse */
               console.warn(`Abulafia Warning: could not parse line "${entry}"`)
             }
killedBy: Tests for abulafia.js loads a minimal table with a bad entries and logs a warning and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: could not parse line \"bad\""

Number of calls: 0

[Killed] EqualityOperator
Projects/abulafia-ts/src/abulafia.ts:102:13
             }
           }
         }
-        if (list.length > 0) {
+        if (list.length >= 0) {
           this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
         } else {                                            /* warn if we skipped a table because it has no entries */
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "key",

[Killed] ConditionalExpression
Projects/abulafia-ts/src/abulafia.ts:102:13
             }
           }
         }
-        if (list.length > 0) {
+        if (false) {
           this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
         } else {                                            /* warn if we skipped a table because it has no entries */
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: Error: Abulafia Error: No table for key "key"

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:104:16
         }
         if (list.length > 0) {
           this.data.set(tableName, list);                   /* add the table to our data set, overwriting if needed */
-        } else {                                            /* warn if we skipped a table because it has no entries */
-          console.warn(`Abulafia Warning: table "${tableName}" has no entries and was skipped`);
-        }
+        } else {}
       }
     }
killedBy: Tests for abulafia.js loads an empty table and returns correct output
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Abulafia Warning: table \"key\" has no entries and was skipped"

Number of calls: 0

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:111:44
     }
   }
 
-  public auditForMissingTables(): string[] {
-    const out: string[] = [];
-    this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
-    });
-    return out;
-  }
+  public auditForMissingTables(): string[] {}
 
 }
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
Projects/abulafia-ts/src/abulafia.ts:112:27
   }
 
   public auditForMissingTables(): string[] {
-    const out: string[] = [];
+    const out: string[] = ["Stryker was here"];
     this.data.forEach((value) => {
       value.forEach((str) => {
killedBy: Tests for abulafia.js throws errors and returns empty values when first initialized
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:113:34
 
   public auditForMissingTables(): string[] {
     const out: string[] = [];
-    this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
-    });
+    this.data.forEach((value) => {});
     return out;
   }
killedBy: Tests for abulafia.js detects missing references
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "value",
- ]
