[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:114:30
   public auditForMissingTables(): string[] {
     const out: string[] = [];
     this.data.forEach((value) => {
-      value.forEach((str) => {
-        str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
-      })
+      value.forEach((str) => {})
     });
     return out;
killedBy: Tests for abulafia.js detects missing references
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "value",
- ]

[Killed] OptionalChaining
Projects/abulafia-ts/src/abulafia.ts:115:9
     const out: string[] = [];
     this.data.forEach((value) => {
       value.forEach((str) => {
-        str.match(this.auditRegex)?.forEach((match) => {
+        str.match(this.auditRegex).forEach((match) => {
           if(!this.hasTable(match.substring(1,match.length-1))) {
             out.push(match.substring(1,match.length-1));
killedBy: Tests for abulafia.js loads a minimal table and returns correct output
statusReason: TypeError: Cannot read property 'forEach' of null

[Killed] BlockStatement
Projects/abulafia-ts/src/abulafia.ts:115:56
     const out: string[] = [];
     this.data.forEach((value) => {
       value.forEach((str) => {
-        str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
-          }
-        })
+        str.match(this.auditRegex)?.forEach((match) => {})
       })
     });
killedBy: Tests for abulafia.js detects missing references
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "value",
- ]

[Killed] ArithmeticOperator
Projects/abulafia-ts/src/abulafia.ts:116:47
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
+          if(!this.hasTable(match.substring(1,match.length + 1))) {
             out.push(match.substring(1,match.length-1));
           }
killedBy: Tests for abulafia.js loads multiple tables with references and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   "key2",

[Killed] BooleanLiteral
Projects/abulafia-ts/src/abulafia.ts:116:14
     this.data.forEach((value) => {
       value.forEach((str) => {
         str.match(this.auditRegex)?.forEach((match) => {
-          if(!this.hasTable(match.substring(1,match.length-1))) {
+          if(this.hasTable(match.substring(1, match.length - 1))) {
             out.push(match.substring(1,match.length-1));
           }
killedBy: Tests for abulafia.js loads multiple tables with references and returns correct output
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 5

- Array []
+ Array [
+   "key2",

[Killed] ArithmeticOperator
Projects/abulafia-ts/src/abulafia.ts:117:40
       value.forEach((str) => {
         str.match(this.auditRegex)?.forEach((match) => {
           if(!this.hasTable(match.substring(1,match.length-1))) {
-            out.push(match.substring(1,match.length-1));
+            out.push(match.substring(1,match.length + 1));
           }
         })
killedBy: Tests for abulafia.js detects missing references
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "value",
+   "value]",
